app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 10]]
---
  def index
    @comments = @post.comments.all

INSERT INTO "comments" ("bdy", "created_at", "updated_at", "post_id", "user_id") VALUES (?, ?, ?, ?, ?)  [["bdy", "dsd"], ["created_at", "2017-12-12 21:05:48.744845"], ["updated_at", "2017-12-12 21:05:48.744845"], ["post_id", 3], ["user_id", 1]]
---
  def create
    @comment = @post.comments.build(comment_params)
    @comment.user= current_user

    respond_to do |format|
      if @comment.save