app/controllers/posts_controller.rb

  def index

    if params[:user]
      @posts = Post.where(user: params[:user]).order("created_at DESC")
    else
       @posts = Post.all.order("created_at DESC")
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1 ORDER BY created_at DESC
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

  def show
    @likeds=Like.where(post: @post).all
    @comments=@post.comments.all
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 3]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]

  def create

    @post = Post.new(post_params)
    @post.user=current_user
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "msg", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Welcome"], ["msg", ""], ["created_at", "2017-12-16 21:46:28.674975"], ["updated_at", "2017-12-16 21:46:28.674975"], ["user_id", 3]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "msg" = ?, "updated_at" = ? WHERE "posts"."id" = ?

  def like
    @l=Like.new
    @l.post=@post
    @l.user=current_user
    @l.save
---
INSERT INTO "likes" ("user_id", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?)  [["user_id", 1], ["created_at", "2017-12-12 14:05:04.526621"], ["updated_at", "2017-12-12 14:05:04.526621"], ["post_id", 3]]

  def unlike
    @l=Like.where(post:@post,user:current_user).first
    @l.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = 3 AND "likes"."user_id" = 1 ORDER BY "likes"."id" ASC LIMIT ?  [["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]